0cococ/ESP32-BLE-HID/BleComboKeyboard.cpp
#include <BLEDevice.h>
#include <BLEUtils.h>
#include <BLEServer.h>
#include "BLE2902.h"
#include "BLEHIDDevice.h"
#include "HIDTypes.h"
#include <driver/adc.h>
#include "sdkconfig.h"
#include <WiFi.h>


#include "BleConnectionStatus.h"
#include "KeyboardOutputCallbacks.h"
#include "BleComboKeyboard.h"

#if defined(CONFIG_ARDUHAL_ESP_LOG)
  #include "esp32-hal-log.h"
  #define LOG_TAG ""
#else
  #include "esp_log.h"
  static const char* LOG_TAG = "BLEDevice";
#endif


// Report IDs:
#define KEYBOARD_ID 0x01
#define MEDIA_KEYS_ID 0x02
#define MOUSE_ID 0x03
static const uint8_t _hidReportDescriptor[] = {
  USAGE_PAGE(1),      0x01,          // USAGE_PAGE (Generic Desktop Ctrls)
  USAGE(1),           0x06,          // USAGE (Keyboard)
  COLLECTION(1),      0x01,          // COLLECTION (Application)
  // ------------------------------------------------- Keyboard
  REPORT_ID(1),       KEYBOARD_ID,   //   REPORT_ID (1)
  USAGE_PAGE(1),      0x07,          //   USAGE_PAGE (Kbrd/Keypad)
  USAGE_MINIMUM(1),   0xE0,          //   USAGE_MINIMUM (0xE0)
  USAGE_MAXIMUM(1),   0xE7,          //   USAGE_MAXIMUM (0xE7)
  LOGICAL_MINIMUM(1), 0x00,          //   LOGICAL_MINIMUM (0)
  LOGICAL_MAXIMUM(1), 0x01,          //   Logical Maximum (1)
  REPORT_SIZE(1),     0x01,          //   REPORT_SIZE (1)
  REPORT_COUNT(1),    0x08,          //   REPORT_COUNT (8)
  HIDINPUT(1),        0x02,          //   INPUT (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
  REPORT_COUNT(1),    0x01,          //   REPORT_COUNT (1) ; 1 byte (Reserved)
  REPORT_SIZE(1),     0x08,          //   REPORT_SIZE (8)
  HIDINPUT(1),        0x01,          //   INPUT (Const,Array,Abs,No Wrap,Linear,Preferred State,No Null Position)
  REPORT_COUNT(1),    0x05,          //   REPORT_COUNT (5) ; 5 bits (Num lock, Caps lock, Scroll lock, Compose, Kana)
  REPORT_SIZE(1),     0x01,          //   REPORT_SIZE (1)
  USAGE_PAGE(1),      0x08,          //   USAGE_PAGE (LEDs)
  USAGE_MINIMUM(1),   0x01,          //   USAGE_MINIMUM (0x01) ; Num Lock
  USAGE_MAXIMUM(1),   0x05,          //   USAGE_MAXIMUM (0x05) ; Kana
  HIDOUTPUT(1),       0x02,          //   OUTPUT (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position,Non-volatile)
  REPORT_COUNT(1),    0x01,          //   REPORT_COUNT (1) ; 3 bits (Padding)
  REPORT_SIZE(1),     0x03,          //   REPORT_SIZE (3)
  HIDOUTPUT(1),       0x01,          //   OUTPUT (Const,Array,Abs,No Wrap,Linear,Preferred State,No Null Position,Non-volatile)
  REPORT_COUNT(1),    0x06,          //   REPORT_COUNT (6) ; 6 bytes (Keys)
  REPORT_SIZE(1),     0x08,          //   REPORT_SIZE(8)
  LOGICAL_MINIMUM(1), 0x00,          //   LOGICAL_MINIMUM(0)
  LOGICAL_MAXIMUM(1), 0x65,          //   LOGICAL_MAXIMUM(0x65) ; 101 keys
  USAGE_PAGE(1),      0x07,          //   USAGE_PAGE (Kbrd/Keypad)
  USAGE_MINIMUM(1),   0x00,          //   USAGE_MINIMUM (0)
  USAGE_MAXIMUM(1),   0x65,          //   USAGE_MAXIMUM (0x65)
  HIDINPUT(1),        0x00,          //   INPUT (Data,Array,Abs,No Wrap,Linear,Preferred State,No Null Position)
  END_COLLECTION(0),                 // END_COLLECTION
  // ------------------------------------------------- Media Keys
  0x05, 0x0C,          //     USAGE_PAGE (Consumer)
  0x09, 0x01,          //     USAGE (Consumer Control)
  0xa1, 0x01,          //     COLLECTION (Application)
  0x85, MEDIA_KEYS_ID, //   REPORT_ID (3)
  0x05, 0x0C,          //   USAGE_PAGE (Consumer)
  0x15, 0x00,          //   LOGICAL_MINIMUM (0)
  0x25, 0x01,          //   LOGICAL_MAXIMUM (1)
  0x75, 0x01,          //   REPORT_SIZE (1)
  0x95, 0x10,          //   REPORT_COUNT (16)
  0x09, 0x40,          //   USAGE (CONSUMER_MENU)        !INVALID      ; bit 0: 1          
  0x09, 0x34,          //   USAGE (CONSUMER_POWER)         !INVALID    ; bit 1: 2  
  0x09, 0xE2,          //   USAGE (Mute)                               ; bit 2: 4 
  0x09, 0xE9,          //   USAGE (Volume Increment)                 ; bit 3: 8 
  0x09, 0xEA,          //   USAGE (Volume Decrement)                 ; bit 4: 16
  0x0a, 0x32, 0x02,    //   USAGE (ANDRIOD_RECENT_5)     !INVALID      ; bit 5: 32
  0x0a, 0x25, 0x02,    //   USAGE (ANDRIOD_FORWARD)      !INVALID    ; bit 6: 64
  0x0a, 0x23, 0x02,    //   Usage (ANDRIOD_HOME)                    ; bit 7: 128
  0x0a, 0x24, 0x02,    //   Usage (ANDRIOD_BACK)                     ; bit 0: 1
  0x0a, 0x8F, 0x01,    //   Usage (ANDRIOD_RECENT)       !INVALID     ; bit 1: 2
  0x0a, 0x9E, 0x01,    //   Usage (ANDRIOD_POWER)                     ; bit 2: 4
  0x0a, 0x21, 0x02,    //   Usage (ANDRIOD_SEARCH)                   ; bit 3: 8
  0x0a, 0x9F, 0x01,    //   Usage (ANDRIOD_RECENT_1)     !INVALID       ; bit 4: 16
  0x0a, 0xA1, 0x01,    //   Usage (ANDRIOD_RECENT_2)     !INVALID       ; bit 5: 32
  0x0a, 0xA2, 0x01,    //   Usage (ANDRIOD_RECENT_3)     !INVALID      ; bit 6: 64
  0x0a, 0xA3, 0x01,    //   Usage (ANDRIOD_RECENT_4)     !INVALID       ; bit 7: 128
  0x81, 0x02,          //   INPUT (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
  0xc0,                //     END_COLLECTION
  // USAGE_PAGE(1),      0x0C,          // USAGE_PAGE (Consumer)
  // USAGE(1),           0x01,          // USAGE (Consumer Control)
  // COLLECTION(1),      0x01,          // COLLECTION (Application)
  // REPORT_ID(1),       MEDIA_KEYS_ID, //   REPORT_ID (3)
  // USAGE_PAGE(1),      0x0C,          //   USAGE_PAGE (Consumer)
  // LOGICAL_MINIMUM(1), 0x00,          //   LOGICAL_MINIMUM (0)
  // LOGICAL_MAXIMUM(1), 0x01,          //   LOGICAL_MAXIMUM (1)
  // REPORT_SIZE(1),     0x01,          //   REPORT_SIZE (1)
  // REPORT_COUNT(1),    0x10,          //   REPORT_COUNT (16)
  // USAGE(1),           0xB5,          //   USAGE (Scan Next Track)     ; bit 0: 1
  // USAGE(1),           0xB6,          //   USAGE (Scan Previous Track) ; bit 1: 2
  // USAGE(1),           0xB7,          //   USAGE (Stop)                ; bit 2: 4
  // USAGE(1),           0xCD,          //   USAGE (Play/Pause)          ; bit 3: 8
  // USAGE(1),           0xE2,          //   USAGE (Mute)                ; bit 4: 16
  // USAGE(1),           0xE9,          //   USAGE (Volume Increment)    ; bit 5: 32
  // USAGE(1),           0xEA,          //   USAGE (Volume Decrement)    ; bit 6: 64
  // USAGE(2),           0x23, 0x02,    //   Usage (WWW Home)            ; bit 7: 128
  // USAGE(2),           0x94, 0x01,    //   Usage (My Computer) ; bit 0: 1
  // USAGE(2),           0x92, 0x01,    //   Usage (Calculator)  ; bit 1: 2
  // USAGE(2),           0x2A, 0x02,    //   Usage (WWW fav)     ; bit 2: 4
  // USAGE(2),           0x21, 0x02,    //   Usage (WWW search)  ; bit 3: 8
  // USAGE(2),           0x26, 0x02,    //   Usage (WWW stop)    ; bit 4: 16
  // USAGE(2),           0x24, 0x02,    //   Usage (WWW back)    ; bit 5: 32
  // USAGE(2),           0x83, 0x01,    //   Usage (Media sel)   ; bit 6: 64
  // USAGE(2),           0x8A, 0x01,    //   Usage (Mail)        ; bit 7: 128
  // HIDINPUT(1),        0x02,          //   INPUT (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
  // END_COLLECTION(0),                 // END_COLLECTION

