0cococ/ESP32-BLE-HID/BleComboKeyboard.cpp
  // ------------------------------------------------- Mouse
//  USAGE_PAGE(1),       0x01, // USAGE_PAGE (Generic Desktop)
//  USAGE(1),            0x02, // USAGE (Mouse)
//  COLLECTION(1),       0x01, // COLLECTION (Application)
//  USAGE(1),            0x01, //   USAGE (Pointer)
//  COLLECTION(1),       0x00, //   COLLECTION (Physical)
//  REPORT_ID(1),        MOUSE_ID, //     REPORT_ID (1)
//  // ------------------------------------------------- Buttons (Left, Right, Middle, Back, Forward)
//  USAGE_PAGE(1),       0x09, //     USAGE_PAGE (Button)
//  USAGE_MINIMUM(1),    0x01, //     USAGE_MINIMUM (Button 1)
//  USAGE_MAXIMUM(1),    0x05, //     USAGE_MAXIMUM (Button 5)
//  LOGICAL_MINIMUM(1),  0x00, //     LOGICAL_MINIMUM (0)
//  LOGICAL_MAXIMUM(1),  0x01, //     LOGICAL_MAXIMUM (1)
//  REPORT_SIZE(1),      0x01, //     REPORT_SIZE (1)
//  REPORT_COUNT(1),     0x05, //     REPORT_COUNT (5)
//  HIDINPUT(1),         0x02, //     INPUT (Data, Variable, Absolute) ;5 button bits
//  // ------------------------------------------------- Padding
//  REPORT_SIZE(1),      0x03, //     REPORT_SIZE (3)
//  REPORT_COUNT(1),     0x01, //     REPORT_COUNT (1)
//  HIDINPUT(1),         0x03, //     INPUT (Constant, Variable, Absolute) ;3 bit padding
//  // ------------------------------------------------- X/Y position, Wheel
//  USAGE_PAGE(1),       0x01, //     USAGE_PAGE (Generic Desktop)
//  USAGE(1),            0x30, //     USAGE (X)
//  USAGE(1),            0x31, //     USAGE (Y)
//  USAGE(1),            0x38, //     USAGE (Wheel)
//  LOGICAL_MINIMUM(1),  0x81, //     LOGICAL_MINIMUM (-127)
//  LOGICAL_MAXIMUM(1),  0x7f, //     LOGICAL_MAXIMUM (127)
//  REPORT_SIZE(1),      0x08, //     REPORT_SIZE (8)
//  REPORT_COUNT(1),     0x03, //     REPORT_COUNT (3)
//  HIDINPUT(1),         0x06, //     INPUT (Data, Variable, Relative) ;3 bytes (X,Y,Wheel)
//  // ------------------------------------------------- Horizontal wheel
//  USAGE_PAGE(1),       0x0c, //     USAGE PAGE (Consumer Devices)
//  USAGE(2),      0x38, 0x02, //     USAGE (AC Pan)
//  LOGICAL_MINIMUM(1),  0x81, //     LOGICAL_MINIMUM (-127)
//  LOGICAL_MAXIMUM(1),  0x7f, //     LOGICAL_MAXIMUM (127)
//  REPORT_SIZE(1),      0x08, //     REPORT_SIZE (8)
//  REPORT_COUNT(1),     0x01, //     REPORT_COUNT (1)
//  HIDINPUT(1),         0x06, //     INPUT (Data, Var, Rel)
//  END_COLLECTION(0),         //   END_COLLECTION
//  END_COLLECTION(0)          // END_COLLECTION
//     TouchScreen 0-4095
//     0x05, 0x0d,                      
//     0x09, 0x04,                      
//     0xa1, 0x01,                      
//     0x85, MOUSE_ID, 
   
//     0x09, 0x22,       
//     0xa1, 0x00,      
//     0x09, 0x42,       
//     0x15, 0x00,      
//     0x25, 0x01,       
//     0x75, 0x01,       
//     0x95, 0x01,       
//     0x81, 0x02,       
//     0x09, 0x32,       
//     0x15, 0x00,       
//     0x25, 0x01,       
//     0x81, 0x02,      
//     0x09, 0x51,       
//     0x75, 0x05,      
//     0x95, 0x01,      
//     0x16, 0x00, 0x00, 
//     0x26, 0x10, 0x00, 
//     0x81, 0x02,       
//     0x09, 0x47,       
//     0x75, 0x01,       
//     0x95, 0x01,       
//     0x15, 0x00,      
//     0x25, 0x01,       
//     0x81, 0x02,      
//     0x05, 0x01,       
//     0x09, 0x30,       
//     0x75, 0x10,       
//     0x95, 0x01,       
//     0x55, 0x0D,       
//     0x65, 0x33,       
//     0x35, 0x00,       
//     0x46, 0x60, 0x17, 
//     0x26, 0xFF, 0x0F, 
//     0x81, 0x02,       
//     0x09, 0x31,       
//     0x75, 0x10,       
//     0x95, 0x01,       
//     0x55, 0x0D,       
//     0x65, 0x33,       
//     0x35, 0x00,       
//     0x46, 0x26, 0x0E, 
//     0x26, 0xFF, 0x0F, 
//     0x81, 0x02,       
//     0xC0,             
//     0xC0,            
  0x05, 0x0d,                    /* USAGE_PAGE (Digitizer) */
  0x09, 0x04,                    /* USAGE (Touch Screen) */
  0xa1, 0x01,                    /* COLLECTION (Application) */
  0x85, MOUSE_ID,          /*    REPORT_ID */

  /* declare a finger collection */
  0x09, 0x20,                    /*   Usage (Stylus) */
  0xA1, 0x00,                    /*   Collection (Physical) */

  /* Declare a finger touch (finger up/down) */
  0x09, 0x42,                    /*     Usage (Tip Switch) */
  0x09, 0x32,                    /*     USAGE (In Range) */
  0x15, 0x00,                    /*     LOGICAL_MINIMUM (0) */
  0x25, 0x01,                    /*     LOGICAL_MAXIMUM (1) */
  0x75, 0x01,                    /*     REPORT_SIZE (1) */
  0x95, 0x02,                    /*     REPORT_COUNT (2) */
  0x81, 0x02,                    /*     INPUT (Data,Var,Abs) */

  /* Declare the remaining 6 bits of the first data byte as constant -> the driver will ignore them */
  0x75, 0x01,                    /*     REPORT_SIZE (1) */
  0x95, 0x06,                    /*     REPORT_COUNT (6) */
  0x81, 0x01,                    /*     INPUT (Cnst,Ary,Abs) */

  /* Define absolute X and Y coordinates of 16 bit each (percent values multiplied with 100) */
  /* http://www.usb.org/developers/hidpage/Hut1_12v2.pdf */
  /* Chapter 16.2 says: "In the Stylus collection a Pointer physical collection will contain the axes reported by the stylus." */
  0x05, 0x01,                    /*     Usage Page (Generic Desktop) */
  0x09, 0x01,                    /*     Usage (Pointer) */
  0xA1, 0x00,                    /*     Collection (Physical) */
  0x09, 0x30,                    /*        Usage (X) */
  0x09, 0x31,                    /*        Usage (Y) */
  0x16, 0x00, 0x00,              /*        Logical Minimum (0) */
  0x26, 0x10, 0x27,              /*        Logical Maximum (10000) */
  0x36, 0x00, 0x00,              /*        Physical Minimum (0) */
  0x46, 0x10, 0x27,              /*        Physical Maximum (10000) */
  0x66, 0x00, 0x00,              /*        UNIT (None) */
  0x75, 0x10,                    /*        Report Size (16), */
  0x95, 0x02,                    /*        Report Count (2), */
  0x81, 0x02,                    /*        Input (Data,Var,Abs) */
  0xc0,                          /*     END_COLLECTION */
  0xc0,                          /*   END_COLLECTION */
  0xc0                           /* END_COLLECTION */

